GopalSaraf/Practicals/PSDL/include/proc/pic16lf19197.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 071Ah
// bitfield definitions
PIE4_TMR1IE_POSN                         equ 0000h
PIE4_TMR1IE_POSITION                     equ 0000h
PIE4_TMR1IE_SIZE                         equ 0001h
PIE4_TMR1IE_LENGTH                       equ 0001h
PIE4_TMR1IE_MASK                         equ 0001h
PIE4_TMR2IE_POSN                         equ 0001h
PIE4_TMR2IE_POSITION                     equ 0001h
PIE4_TMR2IE_SIZE                         equ 0001h
PIE4_TMR2IE_LENGTH                       equ 0001h
PIE4_TMR2IE_MASK                         equ 0002h
PIE4_TMR4IE_POSN                         equ 0003h
PIE4_TMR4IE_POSITION                     equ 0003h
PIE4_TMR4IE_SIZE                         equ 0001h
PIE4_TMR4IE_LENGTH                       equ 0001h
PIE4_TMR4IE_MASK                         equ 0008h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 071Bh
// bitfield definitions
PIE5_TMR1GIE_POSN                        equ 0000h
PIE5_TMR1GIE_POSITION                    equ 0000h
PIE5_TMR1GIE_SIZE                        equ 0001h
PIE5_TMR1GIE_LENGTH                      equ 0001h
PIE5_TMR1GIE_MASK                        equ 0001h
PIE5_CLC1IE_POSN                         equ 0004h
PIE5_CLC1IE_POSITION                     equ 0004h
PIE5_CLC1IE_SIZE                         equ 0001h
PIE5_CLC1IE_LENGTH                       equ 0001h
PIE5_CLC1IE_MASK                         equ 0010h
PIE5_CLC2IE_POSN                         equ 0005h
PIE5_CLC2IE_POSITION                     equ 0005h
PIE5_CLC2IE_SIZE                         equ 0001h
PIE5_CLC2IE_LENGTH                       equ 0001h
PIE5_CLC2IE_MASK                         equ 0020h
PIE5_CLC3IE_POSN                         equ 0006h
PIE5_CLC3IE_POSITION                     equ 0006h
PIE5_CLC3IE_SIZE                         equ 0001h
PIE5_CLC3IE_LENGTH                       equ 0001h
PIE5_CLC3IE_MASK                         equ 0040h
PIE5_CLC4IE_POSN                         equ 0007h
PIE5_CLC4IE_POSITION                     equ 0007h
PIE5_CLC4IE_SIZE                         equ 0001h
PIE5_CLC4IE_LENGTH                       equ 0001h
PIE5_CLC4IE_MASK                         equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 071Ch
// bitfield definitions
PIE6_CCP1IE_POSN                         equ 0000h
PIE6_CCP1IE_POSITION                     equ 0000h
PIE6_CCP1IE_SIZE                         equ 0001h
PIE6_CCP1IE_LENGTH                       equ 0001h
PIE6_CCP1IE_MASK                         equ 0001h
PIE6_CCP2IE_POSN                         equ 0001h
PIE6_CCP2IE_POSITION                     equ 0001h
PIE6_CCP2IE_SIZE                         equ 0001h
PIE6_CCP2IE_LENGTH                       equ 0001h
PIE6_CCP2IE_MASK                         equ 0002h
PIE6_CRIE_POSN                           equ 0007h
PIE6_CRIE_POSITION                       equ 0007h
PIE6_CRIE_SIZE                           equ 0001h
PIE6_CRIE_LENGTH                         equ 0001h
PIE6_CRIE_MASK                           equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 071Dh
// bitfield definitions
PIE7_CWG1IE_POSN                         equ 0000h
PIE7_CWG1IE_POSITION                     equ 0000h
PIE7_CWG1IE_SIZE                         equ 0001h
PIE7_CWG1IE_LENGTH                       equ 0001h
PIE7_CWG1IE_MASK                         equ 0001h
PIE7_NVMIE_POSN                          equ 0005h
PIE7_NVMIE_POSITION                      equ 0005h
PIE7_NVMIE_SIZE                          equ 0001h
PIE7_NVMIE_LENGTH                        equ 0001h
PIE7_NVMIE_MASK                          equ 0020h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 071Eh
// bitfield definitions
PIE8_SMT1IE_POSN                         equ 0000h
PIE8_SMT1IE_POSITION                     equ 0000h
PIE8_SMT1IE_SIZE                         equ 0001h
PIE8_SMT1IE_LENGTH                       equ 0001h
PIE8_SMT1IE_MASK                         equ 0001h
PIE8_SMT1PRAIE_POSN                      equ 0001h
PIE8_SMT1PRAIE_POSITION                  equ 0001h
PIE8_SMT1PRAIE_SIZE                      equ 0001h
PIE8_SMT1PRAIE_LENGTH                    equ 0001h
PIE8_SMT1PRAIE_MASK                      equ 0002h
PIE8_SMT1PWAIE_POSN                      equ 0002h
PIE8_SMT1PWAIE_POSITION                  equ 0002h
PIE8_SMT1PWAIE_SIZE                      equ 0001h
PIE8_SMT1PWAIE_LENGTH                    equ 0001h
PIE8_SMT1PWAIE_MASK                      equ 0004h
PIE8_RTCCIE_POSN                         equ 0006h
PIE8_RTCCIE_POSITION                     equ 0006h
PIE8_RTCCIE_SIZE                         equ 0001h
PIE8_RTCCIE_LENGTH                       equ 0001h
PIE8_RTCCIE_MASK                         equ 0040h
PIE8_LCDIE_POSN                          equ 0007h
PIE8_LCDIE_POSITION                      equ 0007h
PIE8_LCDIE_SIZE                          equ 0001h
PIE8_LCDIE_LENGTH                        equ 0001h
PIE8_LCDIE_MASK                          equ 0080h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0796h
// bitfield definitions
PMD0_IOCMD_POSN                          equ 0000h
PMD0_IOCMD_POSITION                      equ 0000h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0001h
PMD0_NVMMD_POSN                          equ 0002h
PMD0_NVMMD_POSITION                      equ 0002h
PMD0_NVMMD_SIZE                          equ 0001h
PMD0_NVMMD_LENGTH                        equ 0001h
PMD0_NVMMD_MASK                          equ 0004h
PMD0_ACTMD_POSN                          equ 0005h
PMD0_ACTMD_POSITION                      equ 0005h
PMD0_ACTMD_SIZE                          equ 0001h
PMD0_ACTMD_LENGTH                        equ 0001h
PMD0_ACTMD_MASK                          equ 0020h
PMD0_FVRMD_POSN                          equ 0006h
PMD0_FVRMD_POSITION                      equ 0006h
PMD0_FVRMD_SIZE                          equ 0001h
PMD0_FVRMD_LENGTH                        equ 0001h
PMD0_FVRMD_MASK                          equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0797h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h

