GopalSaraf/Practicals/PSDL/include/proc/pic16lf19197.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 01D2Ch
// bitfield definitions
LCDDATA20_S16C3_POSN                     equ 0000h
LCDDATA20_S16C3_POSITION                 equ 0000h
LCDDATA20_S16C3_SIZE                     equ 0001h
LCDDATA20_S16C3_LENGTH                   equ 0001h
LCDDATA20_S16C3_MASK                     equ 0001h
LCDDATA20_S17C3_POSN                     equ 0001h
LCDDATA20_S17C3_POSITION                 equ 0001h
LCDDATA20_S17C3_SIZE                     equ 0001h
LCDDATA20_S17C3_LENGTH                   equ 0001h
LCDDATA20_S17C3_MASK                     equ 0002h
LCDDATA20_S18C3_POSN                     equ 0002h
LCDDATA20_S18C3_POSITION                 equ 0002h
LCDDATA20_S18C3_SIZE                     equ 0001h
LCDDATA20_S18C3_LENGTH                   equ 0001h
LCDDATA20_S18C3_MASK                     equ 0004h
LCDDATA20_S19C3_POSN                     equ 0003h
LCDDATA20_S19C3_POSITION                 equ 0003h
LCDDATA20_S19C3_SIZE                     equ 0001h
LCDDATA20_S19C3_LENGTH                   equ 0001h
LCDDATA20_S19C3_MASK                     equ 0008h
LCDDATA20_S20C3_POSN                     equ 0004h
LCDDATA20_S20C3_POSITION                 equ 0004h
LCDDATA20_S20C3_SIZE                     equ 0001h
LCDDATA20_S20C3_LENGTH                   equ 0001h
LCDDATA20_S20C3_MASK                     equ 0010h
LCDDATA20_S21C3_POSN                     equ 0005h
LCDDATA20_S21C3_POSITION                 equ 0005h
LCDDATA20_S21C3_SIZE                     equ 0001h
LCDDATA20_S21C3_LENGTH                   equ 0001h
LCDDATA20_S21C3_MASK                     equ 0020h
LCDDATA20_S22C3_POSN                     equ 0006h
LCDDATA20_S22C3_POSITION                 equ 0006h
LCDDATA20_S22C3_SIZE                     equ 0001h
LCDDATA20_S22C3_LENGTH                   equ 0001h
LCDDATA20_S22C3_MASK                     equ 0040h
LCDDATA20_S23C3_POSN                     equ 0007h
LCDDATA20_S23C3_POSITION                 equ 0007h
LCDDATA20_S23C3_SIZE                     equ 0001h
LCDDATA20_S23C3_LENGTH                   equ 0001h
LCDDATA20_S23C3_MASK                     equ 0080h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 01D2Dh
// bitfield definitions
LCDDATA21_S24C3_POSN                     equ 0000h
LCDDATA21_S24C3_POSITION                 equ 0000h
LCDDATA21_S24C3_SIZE                     equ 0001h
LCDDATA21_S24C3_LENGTH                   equ 0001h
LCDDATA21_S24C3_MASK                     equ 0001h
LCDDATA21_S25C3_POSN                     equ 0001h
LCDDATA21_S25C3_POSITION                 equ 0001h
LCDDATA21_S25C3_SIZE                     equ 0001h
LCDDATA21_S25C3_LENGTH                   equ 0001h
LCDDATA21_S25C3_MASK                     equ 0002h
LCDDATA21_S26C3_POSN                     equ 0002h
LCDDATA21_S26C3_POSITION                 equ 0002h
LCDDATA21_S26C3_SIZE                     equ 0001h
LCDDATA21_S26C3_LENGTH                   equ 0001h
LCDDATA21_S26C3_MASK                     equ 0004h
LCDDATA21_S27C3_POSN                     equ 0003h
LCDDATA21_S27C3_POSITION                 equ 0003h
LCDDATA21_S27C3_SIZE                     equ 0001h
LCDDATA21_S27C3_LENGTH                   equ 0001h
LCDDATA21_S27C3_MASK                     equ 0008h
LCDDATA21_S28C3_POSN                     equ 0004h
LCDDATA21_S28C3_POSITION                 equ 0004h
LCDDATA21_S28C3_SIZE                     equ 0001h
LCDDATA21_S28C3_LENGTH                   equ 0001h
LCDDATA21_S28C3_MASK                     equ 0010h
LCDDATA21_S29C3_POSN                     equ 0005h
LCDDATA21_S29C3_POSITION                 equ 0005h
LCDDATA21_S29C3_SIZE                     equ 0001h
LCDDATA21_S29C3_LENGTH                   equ 0001h
LCDDATA21_S29C3_MASK                     equ 0020h
LCDDATA21_S30C3_POSN                     equ 0006h
LCDDATA21_S30C3_POSITION                 equ 0006h
LCDDATA21_S30C3_SIZE                     equ 0001h
LCDDATA21_S30C3_LENGTH                   equ 0001h
LCDDATA21_S30C3_MASK                     equ 0040h
LCDDATA21_S31C3_POSN                     equ 0007h
LCDDATA21_S31C3_POSITION                 equ 0007h
LCDDATA21_S31C3_SIZE                     equ 0001h
LCDDATA21_S31C3_LENGTH                   equ 0001h
LCDDATA21_S31C3_MASK                     equ 0080h

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 01D2Eh
// bitfield definitions
LCDDATA22_S32C3_POSN                     equ 0000h
LCDDATA22_S32C3_POSITION                 equ 0000h
LCDDATA22_S32C3_SIZE                     equ 0001h
LCDDATA22_S32C3_LENGTH                   equ 0001h
LCDDATA22_S32C3_MASK                     equ 0001h
LCDDATA22_S33C3_POSN                     equ 0001h
LCDDATA22_S33C3_POSITION                 equ 0001h
LCDDATA22_S33C3_SIZE                     equ 0001h
LCDDATA22_S33C3_LENGTH                   equ 0001h
LCDDATA22_S33C3_MASK                     equ 0002h
LCDDATA22_S34C3_POSN                     equ 0002h
LCDDATA22_S34C3_POSITION                 equ 0002h
LCDDATA22_S34C3_SIZE                     equ 0001h
LCDDATA22_S34C3_LENGTH                   equ 0001h
LCDDATA22_S34C3_MASK                     equ 0004h
LCDDATA22_S35C3_POSN                     equ 0003h
LCDDATA22_S35C3_POSITION                 equ 0003h
LCDDATA22_S35C3_SIZE                     equ 0001h
LCDDATA22_S35C3_LENGTH                   equ 0001h
LCDDATA22_S35C3_MASK                     equ 0008h
LCDDATA22_S36C3_POSN                     equ 0004h
LCDDATA22_S36C3_POSITION                 equ 0004h
LCDDATA22_S36C3_SIZE                     equ 0001h
LCDDATA22_S36C3_LENGTH                   equ 0001h
LCDDATA22_S36C3_MASK                     equ 0010h
LCDDATA22_S37C3_POSN                     equ 0005h
LCDDATA22_S37C3_POSITION                 equ 0005h
LCDDATA22_S37C3_SIZE                     equ 0001h
LCDDATA22_S37C3_LENGTH                   equ 0001h
LCDDATA22_S37C3_MASK                     equ 0020h
LCDDATA22_S38C3_POSN                     equ 0006h
LCDDATA22_S38C3_POSITION                 equ 0006h
LCDDATA22_S38C3_SIZE                     equ 0001h
LCDDATA22_S38C3_LENGTH                   equ 0001h
LCDDATA22_S38C3_MASK                     equ 0040h
LCDDATA22_S39C3_POSN                     equ 0007h
LCDDATA22_S39C3_POSITION                 equ 0007h
LCDDATA22_S39C3_SIZE                     equ 0001h
LCDDATA22_S39C3_LENGTH                   equ 0001h
LCDDATA22_S39C3_MASK                     equ 0080h

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
LCDDATA23                                equ 01D2Fh
// bitfield definitions
LCDDATA23_S40C3_POSN                     equ 0000h
LCDDATA23_S40C3_POSITION                 equ 0000h
LCDDATA23_S40C3_SIZE                     equ 0001h
LCDDATA23_S40C3_LENGTH                   equ 0001h
LCDDATA23_S40C3_MASK                     equ 0001h
LCDDATA23_S41C3_POSN                     equ 0001h
LCDDATA23_S41C3_POSITION                 equ 0001h
LCDDATA23_S41C3_SIZE                     equ 0001h
LCDDATA23_S41C3_LENGTH                   equ 0001h
LCDDATA23_S41C3_MASK                     equ 0002h
LCDDATA23_S42C3_POSN                     equ 0002h
LCDDATA23_S42C3_POSITION                 equ 0002h
LCDDATA23_S42C3_SIZE                     equ 0001h
LCDDATA23_S42C3_LENGTH                   equ 0001h
LCDDATA23_S42C3_MASK                     equ 0004h
LCDDATA23_S43C3_POSN                     equ 0003h
LCDDATA23_S43C3_POSITION                 equ 0003h
LCDDATA23_S43C3_SIZE                     equ 0001h
LCDDATA23_S43C3_LENGTH                   equ 0001h
LCDDATA23_S43C3_MASK                     equ 0008h
LCDDATA23_S44C3_POSN                     equ 0004h
LCDDATA23_S44C3_POSITION                 equ 0004h
LCDDATA23_S44C3_SIZE                     equ 0001h
LCDDATA23_S44C3_LENGTH                   equ 0001h
LCDDATA23_S44C3_MASK                     equ 0010h
LCDDATA23_S45C3_POSN                     equ 0005h
LCDDATA23_S45C3_POSITION                 equ 0005h
LCDDATA23_S45C3_SIZE                     equ 0001h
LCDDATA23_S45C3_LENGTH                   equ 0001h
LCDDATA23_S45C3_MASK                     equ 0020h

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
LCDDATA24                                equ 01D30h
// bitfield definitions
LCDDATA24_S00C4_POSN                     equ 0000h
LCDDATA24_S00C4_POSITION                 equ 0000h
LCDDATA24_S00C4_SIZE                     equ 0001h
LCDDATA24_S00C4_LENGTH                   equ 0001h
LCDDATA24_S00C4_MASK                     equ 0001h
LCDDATA24_S01C4_POSN                     equ 0001h
LCDDATA24_S01C4_POSITION                 equ 0001h
LCDDATA24_S01C4_SIZE                     equ 0001h
LCDDATA24_S01C4_LENGTH                   equ 0001h
LCDDATA24_S01C4_MASK                     equ 0002h
LCDDATA24_S02C4_POSN                     equ 0002h
LCDDATA24_S02C4_POSITION                 equ 0002h
LCDDATA24_S02C4_SIZE                     equ 0001h
LCDDATA24_S02C4_LENGTH                   equ 0001h
LCDDATA24_S02C4_MASK                     equ 0004h
LCDDATA24_S03C4_POSN                     equ 0003h
LCDDATA24_S03C4_POSITION                 equ 0003h
LCDDATA24_S03C4_SIZE                     equ 0001h
LCDDATA24_S03C4_LENGTH                   equ 0001h
LCDDATA24_S03C4_MASK                     equ 0008h
LCDDATA24_S04C4_POSN                     equ 0004h
LCDDATA24_S04C4_POSITION                 equ 0004h
LCDDATA24_S04C4_SIZE                     equ 0001h
LCDDATA24_S04C4_LENGTH                   equ 0001h
LCDDATA24_S04C4_MASK                     equ 0010h
LCDDATA24_S05C4_POSN                     equ 0005h
LCDDATA24_S05C4_POSITION                 equ 0005h
LCDDATA24_S05C4_SIZE                     equ 0001h
LCDDATA24_S05C4_LENGTH                   equ 0001h
LCDDATA24_S05C4_MASK                     equ 0020h
LCDDATA24_S06C4_POSN                     equ 0006h
LCDDATA24_S06C4_POSITION                 equ 0006h
LCDDATA24_S06C4_SIZE                     equ 0001h
LCDDATA24_S06C4_LENGTH                   equ 0001h
LCDDATA24_S06C4_MASK                     equ 0040h
LCDDATA24_S07C4_POSN                     equ 0007h
LCDDATA24_S07C4_POSITION                 equ 0007h
LCDDATA24_S07C4_SIZE                     equ 0001h
LCDDATA24_S07C4_LENGTH                   equ 0001h
LCDDATA24_S07C4_MASK                     equ 0080h

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
LCDDATA25                                equ 01D31h
// bitfield definitions
LCDDATA25_S08C4_POSN                     equ 0000h
LCDDATA25_S08C4_POSITION                 equ 0000h
LCDDATA25_S08C4_SIZE                     equ 0001h
LCDDATA25_S08C4_LENGTH                   equ 0001h
LCDDATA25_S08C4_MASK                     equ 0001h
LCDDATA25_S09C4_POSN                     equ 0001h
LCDDATA25_S09C4_POSITION                 equ 0001h
LCDDATA25_S09C4_SIZE                     equ 0001h
LCDDATA25_S09C4_LENGTH                   equ 0001h
LCDDATA25_S09C4_MASK                     equ 0002h
LCDDATA25_S10C4_POSN                     equ 0002h
LCDDATA25_S10C4_POSITION                 equ 0002h
LCDDATA25_S10C4_SIZE                     equ 0001h
LCDDATA25_S10C4_LENGTH                   equ 0001h
LCDDATA25_S10C4_MASK                     equ 0004h
LCDDATA25_S11C4_POSN                     equ 0003h
LCDDATA25_S11C4_POSITION                 equ 0003h
LCDDATA25_S11C4_SIZE                     equ 0001h
LCDDATA25_S11C4_LENGTH                   equ 0001h
LCDDATA25_S11C4_MASK                     equ 0008h
LCDDATA25_S12C4_POSN                     equ 0004h
LCDDATA25_S12C4_POSITION                 equ 0004h
LCDDATA25_S12C4_SIZE                     equ 0001h
LCDDATA25_S12C4_LENGTH                   equ 0001h
LCDDATA25_S12C4_MASK                     equ 0010h
LCDDATA25_S13C4_POSN                     equ 0005h
LCDDATA25_S13C4_POSITION                 equ 0005h
LCDDATA25_S13C4_SIZE                     equ 0001h
LCDDATA25_S13C4_LENGTH                   equ 0001h
LCDDATA25_S13C4_MASK                     equ 0020h
LCDDATA25_S14C4_POSN                     equ 0006h
LCDDATA25_S14C4_POSITION                 equ 0006h
LCDDATA25_S14C4_SIZE                     equ 0001h
LCDDATA25_S14C4_LENGTH                   equ 0001h
LCDDATA25_S14C4_MASK                     equ 0040h
LCDDATA25_S15C4_POSN                     equ 0007h
LCDDATA25_S15C4_POSITION                 equ 0007h
LCDDATA25_S15C4_SIZE                     equ 0001h
LCDDATA25_S15C4_LENGTH                   equ 0001h
LCDDATA25_S15C4_MASK                     equ 0080h

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
LCDDATA26                                equ 01D32h
// bitfield definitions
LCDDATA26_S16C4_POSN                     equ 0000h
LCDDATA26_S16C4_POSITION                 equ 0000h
LCDDATA26_S16C4_SIZE                     equ 0001h
LCDDATA26_S16C4_LENGTH                   equ 0001h
LCDDATA26_S16C4_MASK                     equ 0001h
LCDDATA26_S17C4_POSN                     equ 0001h
LCDDATA26_S17C4_POSITION                 equ 0001h
LCDDATA26_S17C4_SIZE                     equ 0001h
LCDDATA26_S17C4_LENGTH                   equ 0001h
LCDDATA26_S17C4_MASK                     equ 0002h
LCDDATA26_S18C4_POSN                     equ 0002h
LCDDATA26_S18C4_POSITION                 equ 0002h
LCDDATA26_S18C4_SIZE                     equ 0001h
LCDDATA26_S18C4_LENGTH                   equ 0001h
LCDDATA26_S18C4_MASK                     equ 0004h
LCDDATA26_S19C4_POSN                     equ 0003h
LCDDATA26_S19C4_POSITION                 equ 0003h
LCDDATA26_S19C4_SIZE                     equ 0001h
LCDDATA26_S19C4_LENGTH                   equ 0001h
LCDDATA26_S19C4_MASK                     equ 0008h
LCDDATA26_S20C4_POSN                     equ 0004h
LCDDATA26_S20C4_POSITION                 equ 0004h
LCDDATA26_S20C4_SIZE                     equ 0001h
LCDDATA26_S20C4_LENGTH                   equ 0001h
LCDDATA26_S20C4_MASK                     equ 0010h
LCDDATA26_S21C4_POSN                     equ 0005h
LCDDATA26_S21C4_POSITION                 equ 0005h
LCDDATA26_S21C4_SIZE                     equ 0001h
LCDDATA26_S21C4_LENGTH                   equ 0001h
LCDDATA26_S21C4_MASK                     equ 0020h
LCDDATA26_S22C4_POSN                     equ 0006h
LCDDATA26_S22C4_POSITION                 equ 0006h
LCDDATA26_S22C4_SIZE                     equ 0001h
LCDDATA26_S22C4_LENGTH                   equ 0001h
LCDDATA26_S22C4_MASK                     equ 0040h
LCDDATA26_S23C4_POSN                     equ 0007h
LCDDATA26_S23C4_POSITION                 equ 0007h
LCDDATA26_S23C4_SIZE                     equ 0001h
LCDDATA26_S23C4_LENGTH                   equ 0001h
LCDDATA26_S23C4_MASK                     equ 0080h

// Register: LCDDATA27
#define LCDDATA27 LCDDATA27
LCDDATA27                                equ 01D33h
// bitfield definitions
LCDDATA27_S24C4_POSN                     equ 0000h
LCDDATA27_S24C4_POSITION                 equ 0000h
LCDDATA27_S24C4_SIZE                     equ 0001h
LCDDATA27_S24C4_LENGTH                   equ 0001h
LCDDATA27_S24C4_MASK                     equ 0001h
LCDDATA27_S25C4_POSN                     equ 0001h
LCDDATA27_S25C4_POSITION                 equ 0001h
LCDDATA27_S25C4_SIZE                     equ 0001h
LCDDATA27_S25C4_LENGTH                   equ 0001h
LCDDATA27_S25C4_MASK                     equ 0002h
LCDDATA27_S26C4_POSN                     equ 0002h
LCDDATA27_S26C4_POSITION                 equ 0002h
LCDDATA27_S26C4_SIZE                     equ 0001h
LCDDATA27_S26C4_LENGTH                   equ 0001h
LCDDATA27_S26C4_MASK                     equ 0004h
LCDDATA27_S27C4_POSN                     equ 0003h
LCDDATA27_S27C4_POSITION                 equ 0003h
LCDDATA27_S27C4_SIZE                     equ 0001h
LCDDATA27_S27C4_LENGTH                   equ 0001h
LCDDATA27_S27C4_MASK                     equ 0008h
LCDDATA27_S28C4_POSN                     equ 0004h
LCDDATA27_S28C4_POSITION                 equ 0004h
LCDDATA27_S28C4_SIZE                     equ 0001h
LCDDATA27_S28C4_LENGTH                   equ 0001h
LCDDATA27_S28C4_MASK                     equ 0010h
LCDDATA27_S29C4_POSN                     equ 0005h
LCDDATA27_S29C4_POSITION                 equ 0005h
LCDDATA27_S29C4_SIZE                     equ 0001h
LCDDATA27_S29C4_LENGTH                   equ 0001h
LCDDATA27_S29C4_MASK                     equ 0020h
LCDDATA27_S30C4_POSN                     equ 0006h
LCDDATA27_S30C4_POSITION                 equ 0006h
LCDDATA27_S30C4_SIZE                     equ 0001h
LCDDATA27_S30C4_LENGTH                   equ 0001h
LCDDATA27_S30C4_MASK                     equ 0040h
LCDDATA27_S31C4_POSN                     equ 0007h
LCDDATA27_S31C4_POSITION                 equ 0007h
LCDDATA27_S31C4_SIZE                     equ 0001h
LCDDATA27_S31C4_LENGTH                   equ 0001h
LCDDATA27_S31C4_MASK                     equ 0080h

// Register: LCDDATA28
#define LCDDATA28 LCDDATA28
LCDDATA28                                equ 01D34h
// bitfield definitions
LCDDATA28_S32C4_POSN                     equ 0000h
LCDDATA28_S32C4_POSITION                 equ 0000h
LCDDATA28_S32C4_SIZE                     equ 0001h
LCDDATA28_S32C4_LENGTH                   equ 0001h
LCDDATA28_S32C4_MASK                     equ 0001h
LCDDATA28_S33C4_POSN                     equ 0001h
LCDDATA28_S33C4_POSITION                 equ 0001h
LCDDATA28_S33C4_SIZE                     equ 0001h
LCDDATA28_S33C4_LENGTH                   equ 0001h
LCDDATA28_S33C4_MASK                     equ 0002h
LCDDATA28_S34C4_POSN                     equ 0002h
LCDDATA28_S34C4_POSITION                 equ 0002h
LCDDATA28_S34C4_SIZE                     equ 0001h
LCDDATA28_S34C4_LENGTH                   equ 0001h
LCDDATA28_S34C4_MASK                     equ 0004h
LCDDATA28_S35C4_POSN                     equ 0003h
LCDDATA28_S35C4_POSITION                 equ 0003h
LCDDATA28_S35C4_SIZE                     equ 0001h
LCDDATA28_S35C4_LENGTH                   equ 0001h
LCDDATA28_S35C4_MASK                     equ 0008h
LCDDATA28_S36C4_POSN                     equ 0004h
LCDDATA28_S36C4_POSITION                 equ 0004h
LCDDATA28_S36C4_SIZE                     equ 0001h
LCDDATA28_S36C4_LENGTH                   equ 0001h
LCDDATA28_S36C4_MASK                     equ 0010h
LCDDATA28_S37C4_POSN                     equ 0005h
LCDDATA28_S37C4_POSITION                 equ 0005h
LCDDATA28_S37C4_SIZE                     equ 0001h
LCDDATA28_S37C4_LENGTH                   equ 0001h
LCDDATA28_S37C4_MASK                     equ 0020h
LCDDATA28_S38C4_POSN                     equ 0006h
LCDDATA28_S38C4_POSITION                 equ 0006h
LCDDATA28_S38C4_SIZE                     equ 0001h
LCDDATA28_S38C4_LENGTH                   equ 0001h
LCDDATA28_S38C4_MASK                     equ 0040h
LCDDATA28_S39C4_POSN                     equ 0007h
LCDDATA28_S39C4_POSITION                 equ 0007h
LCDDATA28_S39C4_SIZE                     equ 0001h
LCDDATA28_S39C4_LENGTH                   equ 0001h
LCDDATA28_S39C4_MASK                     equ 0080h

