GopalSaraf/Practicals/PSDL/include/proc/pic16lf19197.inc
// Register: RH2PPS
#define RH2PPS RH2PPS
RH2PPS                                   equ 01E4Ah
// bitfield definitions
RH2PPS_RH2PPS0_POSN                      equ 0000h
RH2PPS_RH2PPS0_POSITION                  equ 0000h
RH2PPS_RH2PPS0_SIZE                      equ 0001h
RH2PPS_RH2PPS0_LENGTH                    equ 0001h
RH2PPS_RH2PPS0_MASK                      equ 0001h
RH2PPS_RH2PPS1_POSN                      equ 0001h
RH2PPS_RH2PPS1_POSITION                  equ 0001h
RH2PPS_RH2PPS1_SIZE                      equ 0001h
RH2PPS_RH2PPS1_LENGTH                    equ 0001h
RH2PPS_RH2PPS1_MASK                      equ 0002h
RH2PPS_RH2PPS2_POSN                      equ 0002h
RH2PPS_RH2PPS2_POSITION                  equ 0002h
RH2PPS_RH2PPS2_SIZE                      equ 0001h
RH2PPS_RH2PPS2_LENGTH                    equ 0001h
RH2PPS_RH2PPS2_MASK                      equ 0004h
RH2PPS_RH2PPS3_POSN                      equ 0003h
RH2PPS_RH2PPS3_POSITION                  equ 0003h
RH2PPS_RH2PPS3_SIZE                      equ 0001h
RH2PPS_RH2PPS3_LENGTH                    equ 0001h
RH2PPS_RH2PPS3_MASK                      equ 0008h
RH2PPS_RH2PPS4_POSN                      equ 0004h
RH2PPS_RH2PPS4_POSITION                  equ 0004h
RH2PPS_RH2PPS4_SIZE                      equ 0001h
RH2PPS_RH2PPS4_LENGTH                    equ 0001h
RH2PPS_RH2PPS4_MASK                      equ 0010h
RH2PPS_RH2PPS5_POSN                      equ 0005h
RH2PPS_RH2PPS5_POSITION                  equ 0005h
RH2PPS_RH2PPS5_SIZE                      equ 0001h
RH2PPS_RH2PPS5_LENGTH                    equ 0001h
RH2PPS_RH2PPS5_MASK                      equ 0020h

// Register: RH3PPS
#define RH3PPS RH3PPS
RH3PPS                                   equ 01E4Bh
// bitfield definitions
RH3PPS_RH3PPS0_POSN                      equ 0000h
RH3PPS_RH3PPS0_POSITION                  equ 0000h
RH3PPS_RH3PPS0_SIZE                      equ 0001h
RH3PPS_RH3PPS0_LENGTH                    equ 0001h
RH3PPS_RH3PPS0_MASK                      equ 0001h
RH3PPS_RH3PPS1_POSN                      equ 0001h
RH3PPS_RH3PPS1_POSITION                  equ 0001h
RH3PPS_RH3PPS1_SIZE                      equ 0001h
RH3PPS_RH3PPS1_LENGTH                    equ 0001h
RH3PPS_RH3PPS1_MASK                      equ 0002h
RH3PPS_RH3PPS2_POSN                      equ 0002h
RH3PPS_RH3PPS2_POSITION                  equ 0002h
RH3PPS_RH3PPS2_SIZE                      equ 0001h
RH3PPS_RH3PPS2_LENGTH                    equ 0001h
RH3PPS_RH3PPS2_MASK                      equ 0004h
RH3PPS_RH3PPS3_POSN                      equ 0003h
RH3PPS_RH3PPS3_POSITION                  equ 0003h
RH3PPS_RH3PPS3_SIZE                      equ 0001h
RH3PPS_RH3PPS3_LENGTH                    equ 0001h
RH3PPS_RH3PPS3_MASK                      equ 0008h
RH3PPS_RH3PPS4_POSN                      equ 0004h
RH3PPS_RH3PPS4_POSITION                  equ 0004h
RH3PPS_RH3PPS4_SIZE                      equ 0001h
RH3PPS_RH3PPS4_LENGTH                    equ 0001h
RH3PPS_RH3PPS4_MASK                      equ 0010h
RH3PPS_RH3PPS5_POSN                      equ 0005h
RH3PPS_RH3PPS5_POSITION                  equ 0005h
RH3PPS_RH3PPS5_SIZE                      equ 0001h
RH3PPS_RH3PPS5_LENGTH                    equ 0001h
RH3PPS_RH3PPS5_MASK                      equ 0020h

// Register: ANSELF
#define ANSELF ANSELF
ANSELF                                   equ 01E50h
// bitfield definitions
ANSELF_ANSF0_POSN                        equ 0000h
ANSELF_ANSF0_POSITION                    equ 0000h
ANSELF_ANSF0_SIZE                        equ 0001h
ANSELF_ANSF0_LENGTH                      equ 0001h
ANSELF_ANSF0_MASK                        equ 0001h
ANSELF_ANSF1_POSN                        equ 0001h
ANSELF_ANSF1_POSITION                    equ 0001h
ANSELF_ANSF1_SIZE                        equ 0001h
ANSELF_ANSF1_LENGTH                      equ 0001h
ANSELF_ANSF1_MASK                        equ 0002h
ANSELF_ANSF2_POSN                        equ 0002h
ANSELF_ANSF2_POSITION                    equ 0002h
ANSELF_ANSF2_SIZE                        equ 0001h
ANSELF_ANSF2_LENGTH                      equ 0001h
ANSELF_ANSF2_MASK                        equ 0004h
ANSELF_ANSF3_POSN                        equ 0003h
ANSELF_ANSF3_POSITION                    equ 0003h
ANSELF_ANSF3_SIZE                        equ 0001h
ANSELF_ANSF3_LENGTH                      equ 0001h
ANSELF_ANSF3_MASK                        equ 0008h
ANSELF_ANSF4_POSN                        equ 0004h
ANSELF_ANSF4_POSITION                    equ 0004h
ANSELF_ANSF4_SIZE                        equ 0001h
ANSELF_ANSF4_LENGTH                      equ 0001h
ANSELF_ANSF4_MASK                        equ 0010h
ANSELF_ANSF5_POSN                        equ 0005h
ANSELF_ANSF5_POSITION                    equ 0005h
ANSELF_ANSF5_SIZE                        equ 0001h
ANSELF_ANSF5_LENGTH                      equ 0001h
ANSELF_ANSF5_MASK                        equ 0020h
ANSELF_ANSF6_POSN                        equ 0006h
ANSELF_ANSF6_POSITION                    equ 0006h
ANSELF_ANSF6_SIZE                        equ 0001h
ANSELF_ANSF6_LENGTH                      equ 0001h
ANSELF_ANSF6_MASK                        equ 0040h
ANSELF_ANSF7_POSN                        equ 0007h
ANSELF_ANSF7_POSITION                    equ 0007h
ANSELF_ANSF7_SIZE                        equ 0001h
ANSELF_ANSF7_LENGTH                      equ 0001h
ANSELF_ANSF7_MASK                        equ 0080h

// Register: WPUF
#define WPUF WPUF
WPUF                                     equ 01E51h
// bitfield definitions
WPUF_WPUF0_POSN                          equ 0000h
WPUF_WPUF0_POSITION                      equ 0000h
WPUF_WPUF0_SIZE                          equ 0001h
WPUF_WPUF0_LENGTH                        equ 0001h
WPUF_WPUF0_MASK                          equ 0001h
WPUF_WPUF1_POSN                          equ 0001h
WPUF_WPUF1_POSITION                      equ 0001h
WPUF_WPUF1_SIZE                          equ 0001h
WPUF_WPUF1_LENGTH                        equ 0001h
WPUF_WPUF1_MASK                          equ 0002h
WPUF_WPUF2_POSN                          equ 0002h
WPUF_WPUF2_POSITION                      equ 0002h
WPUF_WPUF2_SIZE                          equ 0001h
WPUF_WPUF2_LENGTH                        equ 0001h
WPUF_WPUF2_MASK                          equ 0004h
WPUF_WPUF3_POSN                          equ 0003h
WPUF_WPUF3_POSITION                      equ 0003h
WPUF_WPUF3_SIZE                          equ 0001h
WPUF_WPUF3_LENGTH                        equ 0001h
WPUF_WPUF3_MASK                          equ 0008h
WPUF_WPUF4_POSN                          equ 0004h
WPUF_WPUF4_POSITION                      equ 0004h
WPUF_WPUF4_SIZE                          equ 0001h
WPUF_WPUF4_LENGTH                        equ 0001h
WPUF_WPUF4_MASK                          equ 0010h
WPUF_WPUF5_POSN                          equ 0005h
WPUF_WPUF5_POSITION                      equ 0005h
WPUF_WPUF5_SIZE                          equ 0001h
WPUF_WPUF5_LENGTH                        equ 0001h
WPUF_WPUF5_MASK                          equ 0020h
WPUF_WPUF6_POSN                          equ 0006h
WPUF_WPUF6_POSITION                      equ 0006h
WPUF_WPUF6_SIZE                          equ 0001h
WPUF_WPUF6_LENGTH                        equ 0001h
WPUF_WPUF6_MASK                          equ 0040h
WPUF_WPUF7_POSN                          equ 0007h
WPUF_WPUF7_POSITION                      equ 0007h
WPUF_WPUF7_SIZE                          equ 0001h
WPUF_WPUF7_LENGTH                        equ 0001h
WPUF_WPUF7_MASK                          equ 0080h

